app/controllers/balls_controller.rb

  def index
    if params["keyword"].present?
      @balls = Ball.where("name LIKE ?", "%#{params[:keyword]}%")
    else
      @balls = Ball.all
    end

    @balls = @balls.limit(100)
---
SELECT "balls".* FROM "balls"
SELECT  "balls".* FROM "balls" WHERE (title LIKE '%titleist') LIMIT 100

  def show
    @ball = Ball.find(params[:id])
---
SELECT  "balls".* FROM "balls" WHERE "balls"."id" = ? LIMIT 1  [["id", 6]]

  def create
    Ball.create brand: params[:brand],
                name: params[:name],
                price: (params[:price].to_f * 100).to_i,
                ball_url: params[:url],
                compression: params[:compression]
---
INSERT INTO "balls" ("brand", "name", "price", "ball_url", "compression") VALUES (?, ?, ?, ?, ?)  [["brand", "Nike"], ["name", "Nike 20XI-X"], ["price", 4600], ["ball_url", "http://thesandtrap.com/b/imgs/balls/nike_20xi_x_pkg.jpg"], ["compression", "High"]]

  def edit
    @ball = Ball.find(params[:id])
---
SELECT  "balls".* FROM "balls" WHERE "balls"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @ball = Ball.find(params[:id])
    @ball.update  brand: params[:brand],
                  name: params[:name],
                  price: (params[:price].to_f * 100).to_i,
                  ball_url: params[:url],
                  compression: params[:compression]
---
SELECT  "balls".* FROM "balls" WHERE "balls"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "balls" SET "price" = ?, "compression" = ? WHERE "balls"."id" = ?  [["price", 4999], ["compression", "High"], ["id", 6]]

  def destroy
    Ball.delete(params[:id])
---
DELETE FROM "balls" WHERE "balls"."id" = ?  [["id", 13]]