app/controllers/drivers_controller.rb

  def index
    if params["keyword"].present?
      @drivers = Driver.where("name LIKE ?", "%#{params[:keyword]}%")
    else
      @drivers = Driver.all
    end

    @drivers = @drivers.limit(100)
---
SELECT "drivers".* FROM "drivers"
SELECT  "drivers".* FROM "drivers" WHERE (name LIKE '%nike%') LIMIT 100

  def show
    @driver = Driver.find(params[:id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 7]]

  def create
    Driver.create brand: params[:brand],
                  name: params[:name],
                  price: (params[:price].to_f * 100).to_i,
                  driver_url: params[:url],
                  launch: params[:launch],
                  spin: params[:spin]
---
INSERT INTO "drivers" ("brand", "name", "price", "driver_url", "launch", "spin") VALUES (?, ?, ?, ?, ?, ?)  [["brand", "kdmkdn"], ["name", "jnjnd"], ["price", 3300], ["driver_url", "http://wpmedia.golfwrx.com/wp-content/uploads/2012/04/2Y9G4286_resize3.jpg"], ["launch", "Mid"], ["spin", "Mid"]]

  def edit
    @driver = Driver.find(params[:id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 9]]

  def update
    @driver = Driver.find(params[:id])
    @driver.update brand: params[:brand],
                   name: params[:name],
                   price: (params[:price].to_f * 100).to_i,
                   driver_url: params[:url],
                   launch: params[:launch],
                   spin: params[:spin]
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "drivers" SET "launch" = ?, "spin" = ? WHERE "drivers"."id" = ?  [["launch", "High"], ["spin", "High"], ["id", 24]]

  def destroy
    Driver.delete(params[:id])
---
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 10]]