app/controllers/irons_controller.rb

SELECT "irons".* FROM "irons"
SELECT  "irons".* FROM "irons" WHERE (name LIKE '%ping%') LIMIT 100
---
  def index
    if params["keyword"].present?
      @irons = Iron.where("name LIKE ?", "%#{params[:keyword]}%")
    else
      @irons = Iron.all
    end

    @irons = @irons.limit(100)

SELECT  "irons".* FROM "irons" WHERE "irons"."id" = ? LIMIT 1  [["id", 13]]
---
  def show
    @iron = Iron.find(params[:id])

INSERT INTO "irons" ("brand", "name", "price", "iron_url", "category") VALUES (?, ?, ?, ?, ?)  [["brand", ""], ["name", ""], ["price", 0], ["iron_url", ""], ["category", "Better-Player"]]
---
  def create
    Iron.create brand: params[:brand],
                name: params[:name],
                price: (params[:price].to_f * 100).to_i,
                iron_url: params[:url],
                category: params[:category]

SELECT  "irons".* FROM "irons" WHERE "irons"."id" = ? LIMIT 1  [["id", 13]]
---
  def edit
    @iron = Iron.find(params[:id])

SELECT  "irons".* FROM "irons" WHERE "irons"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "irons" SET "category" = ? WHERE "irons"."id" = ?  [["category", "Better-Player"], ["id", 13]]
---
  def update
    @iron = Iron.find(params[:id])
    @iron.update  brand: params[:brand],
                  name: params[:name],
                  price: (params[:price].to_f * 100).to_i,
                  iron_url: params[:url],
                  category: params[:category]

DELETE FROM "irons" WHERE "irons"."id" = ?  [["id", 16]]
---
  def destroy
    Iron.delete(params[:id])