app/controllers/password_resets_controller.rb

  def edit
    @user = User.find_by_password_reset_token!(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT 1  [["password_reset_token", "6FsoClqcETh1SqZXD4HKWw"]]

  def update
    @user = User.find_by_password_reset_token!(params[:id])
    @user.password = params[:password]
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT 1  [["password_reset_token", "6FsoClqcETh1SqZXD4HKWw"]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$4DFXESYQJQTn1qurKpFyvOY/e6FrvRKCs7oA6SV4KL7MfijwE0iIm"], ["id", 4]]