app/controllers/pros_controller.rb

SELECT "pros".* FROM "pros"
SELECT  "pros".* FROM "pros" WHERE (name LIKE '%1%') LIMIT 100
---
  def index
    if params["keyword"].present?
      @pros = Pro.where("name LIKE ?", "%#{params[:keyword]}%")
    else
      @pros = Pro.all
    end

    @pros = @pros.limit(100)

SELECT  "pros".* FROM "pros" WHERE "pros"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "irons".* FROM "irons" WHERE "irons"."id" = ? LIMIT 1  [["id", 37]]
SELECT  "balls".* FROM "balls" WHERE "balls"."id" = ? LIMIT 1  [["id", 55]]
---
  def show
    @pro = Pro.find(params[:id])

    if @pro.driver_id
      @driver = Driver.find(@pro.driver_id)
    end
    if @pro.iron_id
      @iron = Iron.find(@pro.iron_id)
    end
    if @pro.ball_id
      @ball = Ball.find(@pro.ball_id)

SELECT "drivers".* FROM "drivers"
SELECT "irons".* FROM "irons"
SELECT "balls".* FROM "balls"
---
  def new
    @drivers = Driver.all
    @irons = Iron.all
    @balls = Ball.all

INSERT INTO "pros" ("name", "driver_id", "iron_id", "ball_id") VALUES (?, ?, ?, ?)  [["name", "Jake"], ["driver_id", 43], ["iron_id", 37], ["ball_id", 54]]
---
  def create
    Pro.create  name: params[:name],
                driver_id: params[:driver_id],
                iron_id: params[:iron_id],
                ball_id: params[:ball_id]

SELECT  "pros".* FROM "pros" WHERE "pros"."id" = ? LIMIT 1  [["id", 2]]
SELECT "drivers".* FROM "drivers"
SELECT "irons".* FROM "irons"
SELECT "balls".* FROM "balls"
---
  def edit
    @pro = Pro.find(params[:id])
    @drivers = Driver.all
    @irons = Iron.all
    @balls = Ball.all

SELECT  "pros".* FROM "pros" WHERE "pros"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "pros" SET "driver_id" = ?, "iron_id" = ?, "ball_id" = ? WHERE "pros"."id" = ?  [["driver_id", 43], ["iron_id", 37], ["ball_id", 54], ["id", 2]]
---
  def update
    @pro = Pro.find(params[:id])
    @pro.update  driver_id: params[:driver_id],
                 iron_id: params[:iron_id],
                 ball_id: params[:ball_id]

DELETE FROM "pros" WHERE "pros"."id" = ?  [["id", 4]]
---
  def destroy
    Pro.delete(params[:id])