app/controllers/users_controller.rb

  def create
    p = params.permit(:email, :password)
    @user = User.new(p)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "jake@jake2.com"], ["password_digest", "$2a$10$6w12aWG5Nt9gQUOnUJRw3.HiiqSpvfOGDb6ZZflsG0N9Z3XbgOTe."]]